import Heading from "../../components/Heading";

export default function Why() {
    return (
        <>
            <Heading.h2>なぜこんなものを作ったのか</Heading.h2>
            <p>
                この拡張機能は<a href="https://github.com/appare45/gaming-manaba">gaming-manaba</a>
                という筑波大学の学習支援システムのゲーミング化を行う拡張機能に由来しています。
            </p>
            <p>直接的なきっかけは上記ですが、根本的な理由に私のスキルの向上と個人的な思想の表明があります。</p>
            <Heading.h2>技術的観点</Heading.h2>
            <p>この拡張機能の開発にはTypeScriptやReactを用いています。</p>
            <p>今までこれらをNext.js上でしか使っていなかったので、WebPackを一から自力で設定して構築してみようとしました。</p>
            <Heading.h2>個人的思想</Heading.h2>
            <p>突然ですが、私は先日に新しいPCを自作しました。初めて簡易水冷に挑戦したのですが、色々気づいたことがあります。</p>
            <p>というのも、最近のPCパーツはハイエンドになればなるほどゲーミングを銘打ったもの以外がなくなっていきます。</p>
            <p>
                個人的には開発とかクリエイターとか、ゲーミング用途以外でハイスペックを要求するシチュエーションは非常に多いと思うんですがね。
                どういうわけは世間のデバイスメーカーはゲーミング市場に注力しているようです。
            </p>
            <p>
                そして世間のゲーミングの印象は光ることのようです。1677万色に光って何がうれしいんですかね。最近は冷蔵庫とかヘッドホンまで光り始めているのが腹立たしい。
            </p>
            <p>
                特に簡易水冷クーラーにおいてはその傾向が非常に顕著で、光らないクーラーを製造しているのはほんの数社しかありません。
                設定でLEDをオフにすればいいとかの話ではなく、そもそも光らずにかっこいいデザインというものがほぼありません。
            </p>
            <p>
                私はあまりAppleは好きではないのですが、iPhone 5
                の頃のAppleのデザインは大好きなんです。（これは今でも言えますが）Appleはゲーミングを銘打ってバカみたいに虹色に光らせたことがありますか？？
            </p>
            <p>
                Appleの設計思想そのものは非常に好きではないので、あまりApple製品は持っていない上に、最近のAppleのデザインもあまり好きではないのですが、それでもまだゲーミングを名乗る程落ちぶれているとも思えません。
                逆にAppleが仮にMacBook Pro Gaming
                なんて言って虹色に光るキーボードを搭載したようなものを作ったら、それこそ世の中はおしまいです。みんなアナログで仕事をするべきです。
            </p>
            <p>
                少し話をそらして私が嫌いなAppleの設計思想の話をしましょうかね。AppleはUnix系オペレーティングシステムを用いていながら（ある商業Unix的な意味では用いているからこそなのかもしれませんが）、Linuxにあるような自由な選択という思想と対局の位置にいます。
                これはおそらく自由度を制限することでメーカーの意図した、一貫したユーザーエクスペリエンスを提供するためなのでしょうが、その設計思想は州境そのものとしか考えられません。
            </p>
            <p>
                あまりデジタルデバイスに慣れていない人向けに製品を作っているのなら設定項目を減らしてシンプルさを追及するのもデザインの手法だとは思いますが、現在のAppleがそれを目指しているとも思えません。
                iOSやiPadOSの設定アプリはあらゆる項目が「一般」というわけのわからないカテゴリに属している上に、価格設定は非常に強気です。
            </p>
            <p>
                また、Apple製品では外部サービスとの連携の融通が恐ろしいほど効きません。Androidデバイスを仮にUSB接続をしても中のファイルシステムを覗くことはデフォルトではできません。
                これはおそらく、Appleがユーザーに対して「あなたは自分のデバイスの中身を知る必要はない」という完璧人間な素晴らしい考えを持っているからなのではないかと思っています。
            </p>
            <p>
                だらだらと嫌いなものについてのヘイトを吐き出していましたが、言いたいのは「無意味に単純化しすぎる」ことも「センスもなしに煌びやかにする」ことの双方が完全に邪悪であるということです。
                そして、この拡張機能は（ウェブ業界を独占している）GoogleChromeでのみ動作し、ゲーミングという素晴らしいデザインを群馬大学のウェブサイトに提供します。
            </p>
            <p>
                ゲーミングという謎の虹色に光らせる文化は、ぶっちゃけセンスのない陰キャがただ光らせればかっこいいだろうというだけの理由で流行ったとしか思えません。
                が、こんなことをSNS上に書き込んでは速攻で炎上するので、ここで吐き出しておきます。
            </p>
            <p>
                ここまで世間のゲーミングデバイスとAppleの双方に対して自分の意見をぶつけてきましたが、最も文句を言いたいのは現代の市場であるとしか言いようがありません。
            </p>
            <p>
                資本主義においては資本が正義であり、企業が資本を生み出す原点は需要です。こんなゲーミングが世間に蔓延っているのも消費者の多くがそれを望んだからに他なりません。
                つまり自作パーツのデザインの単調化と、ゲーミングとかいうデザインとも呼べない何かの流行の原因の一端は消費者にあると言っても過言ではありません。
            </p>
            <p>
                現在のMicrosoft
                Windowsに代表されるように一度そのもので市場が定着してしまうと、そこから改革を起こすのは難しくなってしまいます。
                （Windowsに対するヘイトはおまけで語ります。）
            </p>
            <p>
                デザインというのは比較的流行り廃りが激しいものであり、Googleのマテリアルデザインのように同じ思想のデザインの中でもバリエーションが生まれるものです。
            </p>
            <p>
                が、世間のゲーミングデバイスを見ているとどれも1688万色でグラデーションしたり波打ったりしているようにしか見えません。
                （ユーザーがカスタマイズ可能とはいえ）デフォルトで寒色や暖色などのテーマが入っているデバイスもそう多くはないでしょう。
            </p>
            <p>
                自作PCのパーツや周辺機器を設計するデザイナーはみんなチー牛ゲーマーなんでしょうか？もし心の底から1677万色ゲーミングデバイスが大好きな人間がいたら、,
                <a href="https://akiba-pc.watch.impress.co.jp/docs/sp/1302977.html" target="_blank" rel="noreferrer">
                    このような
                </a>
                最高にかっこいいデザインを是非紹介してあげたい。
            </p>
            <p>
                そんなわけで、この拡張機能はゲーミングデバイスを嫌っている私が、ゲーミングを銘打って虹色に光らせることが如何に素晴らしく馬鹿らしいかを証明するために作りました。
            </p>
            <Heading.h2>おまけ -Windowsのシェアに対する市場の責任-</Heading.h2>
            <p>近日公開</p>
        </>
    );
}
